/* Includes ------------------------------------------------------------------*/
#include <main.h>

/* Private define-------------------------------------------------------------*/

/* Private variables----------------------------------------------------------*/
static void Delay_ms(uint16_t);               //ms延时函数

/* Public variables-----------------------------------------------------------*/
Public_t  Public = 
{
	Delay_ms,
};

/* Private function prototypes------------------------------------------------*/

/*
	* @name   Delay_ms
	* @brief  毫秒延时函数
	* @param  ms -> 需要延时的时间
	* @retval None      
*/
static void Delay_ms(uint16_t ms)
{
	uint16_t i,j;
	for(i=0;i<ms;i++)
		for(j=0;j<990;j++);
}
/********************************************************
  End Of File
********************************************************/